#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ВыполнитьТестыНаСервере() Экспорт
	
	Тест_isOk();
	
КонецПроцедуры

#Область Тесты

Процедура Тест_isOk() Экспорт
	
	КодОтвета = 200;
	Результат = КодОтветаHTTP.isOk( КодОтвета );	
	УтверждениеВерно( Результат, Истина );

	ТестПройден( "Тест_isOk" );
	
	//Если ( КодОтветаHTTP.isContinue( КодОтвета ) ) Тогда
	//	Сообщить( "OK" );
	//КонецЕсли;
	//
	//СерверIsOk( КодОтвета );
	//
	//Сообщить( КодОтветаHTTP.НайтиКод( "OK" ) );
	//Сообщить( КодОтветаHTTP.НайтиКод( "CONTInue" ) );
	//Сообщить( КодОтветаHTTP.НайтиИмя( 200 ) );
	//Сообщить( КодОтветаHTTP.НайтиИмя( 100 ) );
	//Сообщить( КодОтветаHTTP.НайтиОписание( "OK" ) );
	//Сообщить( КодОтветаHTTP.НайтиОписание( "CONTInue" ) );
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УтверждениеВерно(ЛевоеЗначение, ПравоеЗначение, Пояснение = "")
	
	Если ЛевоеЗначение <> ПравоеЗначение Тогда
		ВызватьИсключение(СтрШаблон("<%1> не равно <%2>: %3", ЛевоеЗначение, ПравоеЗначение, Пояснение));
	КонецЕсли;
	
КонецПроцедуры

Процедура ТестПройден(Тест)
	
	Сообщить(СтрШаблон("Сервер [OK] %1", Тест));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли