// КодОтветаHTTP: Работа с кодами ответов HTTP для 1С:Предприятие 8
//
// Copyright 2019 Alexander Strizhachuk
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
//
// URL:    https://github.com/astrizhachuk/CodeStatusHTTP
// e-mail: strizhhh@mail.ru
// Версия: 1.0.0
//
// Требования: платформа 1С версии 8.3.10 и выше.
#Область СлужебныйПрограммныйИнтерфейс

Функция КодыОтветаHTTP() Экспорт
	
	Перем ТаблицаКодовОтвета;
	Перем Результат;
	
	Результат = Новый Структура();
	
	ТаблицаКодовОтвета = ТаблицаКодовОтвета();
	
	Для каждого СтрокаТаблицыЗначений Из ТаблицаКодовОтвета Цикл
		
	 	Результат.Вставить( СтрокаТаблицыЗначений.Имя, СтрокаТаблицыЗначений.Код );
		
	КонецЦикла;
	
	Возврат ( Новый ФиксированнаяСтруктура(Результат) );
	
КонецФункции

Функция ИдентификаторыКодовОтветаHTTP() Экспорт
	
	Перем ТаблицаКодовОтвета;
	Перем Результат;
	
	ТаблицаКодовОтвета = ТаблицаКодовОтвета();
	
	Результат = Новый Соответствие();
	
	Для каждого СтрокаТаблицыЗначений Из ТаблицаКодовОтвета Цикл
		
	 	Результат.Вставить( СтрокаТаблицыЗначений.Код, СтрокаТаблицыЗначений.Имя );
		
	КонецЦикла;
	
	Возврат ( Новый ФиксированноеСоответствие(Результат) );
	
КонецФункции

Функция ОписанияКодовОтветаHTTP() Экспорт
	
	Перем ТаблицаКодовОтвета;
	Перем Результат;
	
	Результат = Новый Соответствие();
	
	ТаблицаКодовОтвета = ТаблицаКодовОтвета();
	
	Для каждого СтрокаТаблицыЗначений Из ТаблицаКодовОтвета Цикл
		
	 	Результат.Вставить( СтрокаТаблицыЗначений.Имя, СтрокаТаблицыЗначений.ПолноеИмя );
		
	КонецЦикла;
	
	Возврат ( Новый ФиксированноеСоответствие(Результат) );
	
КонецФункции

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

Функция ТаблицаКодовОтвета()
	
	Перем Результат;
	
	Результат = ОписаниеТаблицыКодовОтвета();
	
	ОписаниеКодаОтвета( Результат, 100, "CONTINUE", "Continue");
	ОписаниеКодаОтвета( Результат, 200, "OK", "OK" );
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеТаблицыКодовОтвета()
	
	Перем Результат;
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить( "Код", Новый ОписаниеТипов("Число") );
	Результат.Колонки.Добавить( "Имя", Новый ОписаниеТипов("Строка") );
	Результат.Колонки.Добавить( "ПолноеИмя", Новый ОписаниеТипов("Строка") );

	Возврат Результат;
	
КонецФункции

Процедура ОписаниеКодаОтвета( ТаблицаКодов, Знач Код, Знач Имя, Знач ПолноеИмя )
	
	Перем ОписаниеКодаОтвета;

	ОписаниеКодаОтвета = ТаблицаКодов.Добавить();
	ОписаниеКодаОтвета.Код = Код;
	ОписаниеКодаОтвета.Имя = Имя;
	ОписаниеКодаОтвета.ПолноеИмя = ПолноеИмя;

КонецПроцедуры

#КонецОбласти