#Область Тесты

&НаКлиенте
Процедура ВыполнитьТесты(Команда)
	
	Тест_НайтиКод();
	Тест_isOk();
	
	ВыполнитьТестыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_НайтиКод() Экспорт
	
	Идентификатор = "CONTInue";
	Результат = КодОтветаHTTP.НайтиКод( Идентификатор );	
	УтверждениеВерно( Результат, 100 );
	
	Идентификатор = "БАБАБАБАБАББУ";
	Результат = КодОтветаHTTP.НайтиКод( Идентификатор );	
	УтверждениеВерно( Результат, Неопределено );

	ТестПройден( "Тест_НайтиКод" );
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_isOk() Экспорт
	
	КодОтвета = 200;
	Результат = КодОтветаHTTP.isOk( КодОтвета );	
	УтверждениеВерно( Результат, Истина );

	ТестПройден( "Тест_isOk" );
	
КонецПроцедуры

#КонецОбласти

//&НаКлиенте
//Процедура КлиентIsOk( Команда )
//	
//	КодОтвета = 200;
//	
//	КодОтветаHTTP.isOk( КодОтвета );
//	
//	Если ( КодОтветаHTTP.isOk( КодОтвета ) ) Тогда
//		Сообщить( "OK" );
//	КонецЕсли;
//	
//	Если ( КодОтветаHTTP.isContinue( КодОтвета ) ) Тогда
//		Сообщить( "OK" );
//	КонецЕсли;
//	
//	СерверIsOk( КодОтвета );
//	
//	Сообщить( КодОтветаHTTP.НайтиКод( "OK" ) );
//	Сообщить( КодОтветаHTTP.НайтиКод( "CONTInue" ) );
//	Сообщить( КодОтветаHTTP.НайтиИмя( 200 ) );
//	Сообщить( КодОтветаHTTP.НайтиИмя( 100 ) );
//	Сообщить( КодОтветаHTTP.НайтиОписание( "OK" ) );
//	Сообщить( КодОтветаHTTP.НайтиОписание( "CONTInue" ) );
//	
//КонецПроцедуры

&НаКлиенте
Процедура УтверждениеВерно(ЛевоеЗначение, ПравоеЗначение, Пояснение = "")
	
	Если ЛевоеЗначение <> ПравоеЗначение Тогда
		ВызватьИсключение(СтрШаблон("<%1> не равно <%2>: %3", ЛевоеЗначение, ПравоеЗначение, Пояснение));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПройден(Тест)
	
	Сообщить(СтрШаблон("[OK] %1", Тест));
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьТестыНаСервере()
	
	Если ПроверитьЗаполнение() Тогда
		РеквизитФормыВЗначение("Объект").ВыполнитьТестыНаСервере();
	КонецЕсли;
	
КонецПроцедуры