#Область Тесты

&НаКлиенте
Процедура ВыполнитьТесты(Команда)
	
	Тест_КодыОтветаHTTP();
	Тест_НайтиКодПоИдентификатору();
	Тест_НайтиИдентификаторПоКоду();
	Тест_НайтиОписаниеПоИдентификатору();
	Тест_isOk();
	
	ВыполнитьТестыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_КодыОтветаHTTP() Экспорт
	
	КоличествоКодов = 2;
	
	Результат = КодОтветаHTTP.КодыОтветаHTTP();
	УтверждениеВерно( Результат.Количество(), КоличествоКодов );

	ТестПройден( "Тест_КодыОтветаHTTP" );
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_НайтиКодПоИдентификатору() Экспорт
	
	Идентификатор = "CONTInue";
	Результат = КодОтветаHTTP.НайтиКодПоИдентификатору( Идентификатор );	
	УтверждениеВерно( Результат, 100 );
	
	Идентификатор = "БАБАБАБАБАББУ";
	Результат = КодОтветаHTTP.НайтиКодПоИдентификатору( Идентификатор );	
	УтверждениеВерно( Результат, Неопределено );
	
	Идентификатор = 10;
	Результат = КодОтветаHTTP.НайтиКодПоИдентификатору( Идентификатор );	
	УтверждениеВерно( Результат, Неопределено );

	ТестПройден( "Тест_НайтиКодПоИдентификатору" );
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_НайтиИдентификаторПоКоду() Экспорт
	
	Код = 100;
	Результат = КодОтветаHTTP.НайтиИдентификаторПоКоду( Код );	
	УтверждениеВерно( Результат, "CONTINUE" );
	
	Код = 9000;
	Результат = КодОтветаHTTP.НайтиИдентификаторПоКоду( Код );	
	УтверждениеВерно( Результат, Неопределено );
	
	Код = "а100";
	Результат = КодОтветаHTTP.НайтиИдентификаторПоКоду( Код );	
	УтверждениеВерно( Результат, Неопределено );

	ТестПройден( "Тест_НайтиИдентификаторПоКоду" );
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_НайтиОписаниеПоИдентификатору() Экспорт
	
	Идентификатор = "CONTInue";
	Результат = КодОтветаHTTP.НайтиОписаниеПоИдентификатору( Идентификатор );	
	УтверждениеВерно( Результат, "Continue" );
	
	Идентификатор = 10;
	Результат = КодОтветаHTTP.НайтиОписаниеПоИдентификатору( Идентификатор );	
	УтверждениеВерно( Результат, Неопределено );

	ТестПройден( "Тест_НайтиОписаниеПоИдентификатору" );
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_isOk() Экспорт
	
	КодОтвета = 200;
	Результат = КодОтветаHTTP.isOk( КодОтвета );	
	УтверждениеВерно( Результат, Истина );

	ТестПройден( "Тест_isOk" );
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УтверждениеВерно(ЛевоеЗначение, ПравоеЗначение, Пояснение = "")
	
	Если ЛевоеЗначение <> ПравоеЗначение Тогда
		ВызватьИсключение(СтрШаблон("<%1> не равно <%2>: %3", ЛевоеЗначение, ПравоеЗначение, Пояснение));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПройден(Тест)
	
	Сообщить(СтрШаблон("Клиент [OK] %1", Тест));
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьТестыНаСервере()
	
	Если ПроверитьЗаполнение() Тогда
		РеквизитФормыВЗначение("Объект").ВыполнитьТестыНаСервере();
	КонецЕсли;
	
КонецПроцедуры