// КодОтветаHTTP: Работа с кодами ответов HTTP для 1С:Предприятие 8
//
// Copyright 2019 Alexander Strizhachuk
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
//
// URL:    https://github.com/astrizhachuk/CodeStatusHTTP
// e-mail: strizhhh@mail.ru
// Версия: 1.0.0
//
// Требования: платформа 1С версии 8.3.10 и выше.
#Область ПрограммныйИнтерфейс

// Соответствие кодов ответа HTTP и их краткому имени, используемого для
// именнованого обращения к элементам структуры.
//	100, "CONTINUE", "Continue"
//	200, "OK", "OK"
// 
// Возвращаемое значение:
//   - ФиксированнаяСтруктура - соответствия числовых кодов и краткого имени ответа:
//		* Ключ - Строка - краткое имя для кода ответа HTTP.
//		* Значение - Число - код ответа HTTP.
//
// Пример:
//	CONTINUE = КодОтветаHTTP.КодыОтветаHTTP().CONTINUE;
//
Функция КодыОтветаHTTP() Экспорт
	
	Возврат КодОтветаHTTPПовтИсп.КодыОтветаHTTP();
	
КонецФункции

// Поиск числового кода ответа HTTP по его краткому имени-идентификатору (См. КодыОтветаHTTP()).
//
// Параметры:
//  Имя - Строка - краткое имя-идентификатор для кода ответа HTTP.
// 
// Возвращаемое значение:
//	- Неопределено - если код по имени-идентификатору не найден.
//	- Число - код ответа HTTP.
//
Функция НайтиКод( Знач Имя ) Экспорт
	
	Возврат КодОтветаHTTPПовтИсп.НайтиКод( Имя ); 
	
КонецФункции

// Поиск краткого имени-идентификатора для кода ответа HTTP по его числовому коду (См. КодыОтветаHTTP()).
//
// Параметры:
//  Код - Число - код ответа HTTP. 
// 
// Возвращаемое значение:
//	- Неопределено - если краткое имя-идентификатор не найдено.
//	- Строка - краткое имя-идентификатора для кода ответа HTTP.
//
Функция НайтиИмя( Знач Код ) Экспорт

	Возврат КодОтветаHTTPПовтИсп.НайтиИмя( Код );

КонецФункции

// Поиск описания для кода ответа HTTP по его краткому имени-идентификатору (См. КодыОтветаHTTP()).
//
// Параметры:
//  Имя - Строка - краткое имя-идентификатора для кода ответа HTTP.
// 
// Возвращаемое значение:
//	- Неопределено - если описание не найдено.
//	- Строка - описание кода ответа HTTP.
//
Функция НайтиОписание( Знач Имя ) Экспорт

	Возврат КодОтветаHTTPПовтИсп.НайтиОписание( Имя );

КонецФункции

Функция isContinue( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().CONTINUE );
	
КонецФункции

Функция isOk( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().OK );

КонецФункции

#КонецОбласти