// КодОтветаHTTP: Работа с кодами ответов HTTP для 1С:Предприятие 8
//
// Copyright 2019 Alexander Strizhachuk
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
//
// URL:    https://github.com/astrizhachuk/CodeStatusHTTP
// e-mail: strizhhh@mail.ru
// Версия: 1.0.0
//
// Требования: платформа 1С версии 8.3.10 и выше.
#Область ПрограммныйИнтерфейс

// Поиск числового кода ответа HTTP по его идентификатору (См. КодыОтветаHTTP()).
//
// Параметры:
//  Имя - Строка - идентификатор для кода ответа HTTP.
// 
// Возвращаемое значение:
//	- Неопределено - если код по идентификатору не найден.
//	- Число - код ответа HTTP.
//
Функция НайтиКодПоИдентификатору( Знач Идентификатор ) Экспорт
	
	Перем КодыОтвета;
	Перем Результат;

	КодыОтвета = КодОтветаHTTPПовтИсп.КодыОтветаHTTP();
	
	Результат = Неопределено;
	
	Попытка
	
		Результат = КодыОтвета[ ВРег(Идентификатор) ];
	
	Исключение
		
		Результат = Неопределено;
	
	КонецПопытки;

	Возврат Результат;
 
КонецФункции

// Поиск идентификатора кода ответа HTTP по его числовому коду (См. КодыОтветаHTTP()).
//
// Параметры:
//  Код - Число - код ответа HTTP. 
// 
// Возвращаемое значение:
//	- Неопределено - если идентификатор не найдено.
//	- Строка - идентификатор для кода ответа HTTP.
//
Функция НайтиИдентификаторПоКоду( Знач Код ) Экспорт
	
	Перем ИдентификаторыКодовОтвета;
	
	ИдентификаторыКодовОтвета = КодОтветаHTTPПовтИсп.ИдентификаторыКодовОтветаHTTP();

	Возврат ИдентификаторыКодовОтвета.Получить( Код );

КонецФункции

// Поиск описания для кода ответа HTTP по его идентификатору (См. КодыОтветаHTTP()).
//
// Параметры:
//  Имя - Строка - идентификатор для кода ответа HTTP.
// 
// Возвращаемое значение:
//	- Неопределено - если описание не найдено.
//	- Строка - описание кода ответа HTTP.
//
Функция НайтиОписаниеПоИдентификатору( Знач Идентификатор ) Экспорт
	
	Перем ОписанияКодовОтвета;
	
	ОписанияКодовОтвета = КодОтветаHTTPПовтИсп.ОписанияКодовОтветаHTTP();
	
	Возврат ОписанияКодовОтвета.Получить( ВРег(Идентификатор) );

КонецФункции

#Область Informational_1xx

Функция isContinue( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().CONTINUE );
	
КонецФункции

Функция isSwitchingProtocols( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().SWITCHING_PROTOCOLS );
	
КонецФункции

Функция isProcessing( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().PROCESSING );
	
КонецФункции

Функция isCheckpoint( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().CHECKPOINT );
	
КонецФункции

#КонецОбласти

#Область Success_2xx

Функция isOk( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().OK );

КонецФункции

Функция isCreated( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().CREATED );

КонецФункции

Функция isAccepted( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().ACCEPTED );

КонецФункции

Функция isNonAuthoritative( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().NON_AUTHORITATIVE_INFORMATION );

КонецФункции

Функция isNoContent( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().NO_CONTENT );

КонецФункции

Функция isResetContent( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().RESET_CONTENT );

КонецФункции

Функция isPartialContent( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().PARTIAL_CONTENT );

КонецФункции

Функция isMultiStatus( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().MULTI_STATUS );

КонецФункции

Функция isAlreadyReported( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().ALREADY_REPORTED );

КонецФункции

Функция isIMUsed( Знач Код ) Экспорт
	
	Возврат ( Код = КодыОтветаHTTP().IM_USED );

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Соответствие кодов ответа HTTP и их краткому имени, используемого для
// именнованого обращения к элементам структуры.
//	100, "CONTINUE", "Continue"
//	200, "OK", "OK"
// 
// Возвращаемое значение:
//   - ФиксированнаяСтруктура - соответствия числовых кодов и краткого имени ответа:
//		* Ключ - Строка - краткое имя для кода ответа HTTP.
//		* Значение - Число - код ответа HTTP.
//
// Пример:
//	CONTINUE = КодОтветаHTTP.КодыОтветаHTTP().CONTINUE;
//
Функция КодыОтветаHTTP() Экспорт
	
	Возврат КодОтветаHTTPПовтИсп.КодыОтветаHTTP();
	
КонецФункции

#КонецОбласти